# Notes

This assignment is devoted to `pandas`. It covers indexing and filtering, and some `groupby` and `join` operations. The assignment roughly corresponds to Week 4 and the beginning of Week 5 of the course.

The main dataset you'll be using is [Titanic](https://www.kaggle.com/c/titanic).

In [1]:
%pylab inline
plt.style.use("bmh")

Populating the interactive namespace from numpy and matplotlib

In [2]:
plt.rcParams["figure.figsize"] = (6,6)

In [3]:
import numpy as np
import pandas as pd

In [4]:
STUDENT = "Adam Cohn"
ASSIGNMENT = 4
TEST = False

In [5]:
if TEST:
    import solutions
    total_grade = 0
    MAX_POINTS = 16

# Indexing and filtering

### 1. Fixing age (1 point).

There are several known mistakes in the Titanic dataset.

Namely, [Julia Florence Siegel](https://www.encyclopedia-titanica.org/titanic-survivor/julia-florence-cavendish.html) (Mrs. Tyrell William Cavendish) is mistakenly marked as being 76 years old (the age she actually died, but many years after Titanic).

You must replace age value for her with her actual age at the time (25) and return the dataset. Input is indexed with `PassengerId` and is a concatenation of train and test sets. You must return a copy of the dataframe, and not perform replacement in original dataframe. Structure and indexing must be the same as in input.

In [6]:
df = pd.read_csv('titanic.csv', index_col='PassengerId')

In [7]:
def fix_age(df):
    """Fix age for Julia Florence Siegel."""
    data = df.copy()
    data.loc[data.index == 988, 'Age'] = 25
    return data

In [8]:
PROBLEM_ID = 1

if TEST:
    total_grade += solutions.check(STUDENT, PROBLEM_ID, fix_age)

In [23]:
data = fix_age(df)
# df.loc[df.index == 988].head()
data.loc[data.index == 988].head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
988,NaN,1,"Cavendish, Mrs. Tyrell William (Julia Florence...",female,25.0,1,0,19877,78.85,C46,S

### 2. Embarkment port distribution (1 point).

You must find the value counts for embarkment port (`Embarked` column) for the passengers, who travelled in 3-d class, were male and between 20 and 30 years old (both inclusive). No need to treat missing values separately.

Input is indexed with `PassengerId` and is a concatenation of train and test sets. You must return series, indexed with values from `Embarked`, according to `.value_counts()` method semantics.

In [27]:
def embarked_stats(df):
    """Calculate embarkment port statistics."""
    subset = df.copy()
    return subset.loc[(subset.Pclass == 3) & (subset.Sex == 'male') & 
                      (subset.Age.between(20, 30, inclusive=True))].Embarked.value_counts()

In [28]:
PROBLEM_ID = 2

if TEST:
    total_grade += solutions.check(STUDENT, PROBLEM_ID, embarked_stats)

In [33]:
embarked = embarked_stats(data)
embarked

S    132
C     21
Q      7
Name: Embarked, dtype: int64

### 3. Fill missing age values (1 point).

Some age values are missing in the Titanic dataset. You need to calculate average age, and fill missing age values in `Age` column.

Input is indexed with `PassengerId` and is a concatenation of train and test sets. Output must be a **new** dataframe with the same structure, but without missing values in `Age` column.

In [34]:
def fix_age(df):
    """Fix missing age values."""
    data = df.copy()
    data['Age'] = data.Age.fillna(data.Age.mean())
    return data

In [35]:
PROBLEM_ID = 3

if TEST:
    total_grade += solutions.check(STUDENT, PROBLEM_ID, fix_age)

In [36]:
data = fix_age(data)
data.loc[df.Age.isna()]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
6,0.0,3,"Moran, Mr. James",male,29.83238,0,0,330877,8.4583,NaN,Q
18,1.0,2,"Williams, Mr. Charles Eugene",male,29.83238,0,0,244373,13.0000,NaN,S
20,1.0,3,"Masselmani, Mrs. Fatima",female,29.83238,0,0,2649,7.2250,NaN,C
27,0.0,3,"Emir, Mr. Farred Chehab",male,29.83238,0,0,2631,7.2250,NaN,C
29,1.0,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,29.83238,0,0,330959,7.8792,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...
1300,NaN,3,"Riordan, Miss. Johanna Hannah""""",female,29.83238,0,0,334915,7.7208,NaN,Q
1302,NaN,3,"Naughton, Miss. Hannah",female,29.83238,0,0,365237,7.7500,NaN,Q
1305,NaN,3,"Spector, Mr. Woolf",male,29.83238,0,0,A.5. 3236,8.0500,NaN,S
1308,NaN,3,"Ware, Mr. Frederick",male,29.83238,0,0,359309,8.0500,NaN,S
1309,NaN,3,"Peter, Master. Michael J",male,29.83238,1,1,2668,22.3583,NaN,C

### 4. Child travelling alone (1 point).

You must find a child (`Age<10`) on-board, who was travelling without siblings or parents and find a name of her nursemaid.

Input is indexed with `PassengerId` and is a concatenation of train and test sets. Output must be a tuple of two strings, collected from `Name` column, with one being child's name and second being nursemaid's name. It's known, that there's only one child like this.

In [59]:
def get_nursemaid(df):
    ticket = df.loc[(df.Age < 10) & (df.SibSp == 0) & (df.Parch == 0)]['Ticket']
    return tuple(df.loc[df.Ticket==ticket.iloc[0]]['Name'].values)

In [60]:
PROBLEM_ID = 4

if TEST:
    total_grade += solutions.check(STUDENT, PROBLEM_ID, get_nursemaid)

In [61]:
nurse = get_nursemaid(data)
nurse

('Dowdell, Miss. Elizabeth', 'Emanuel, Miss. Virginia Ethel')

### 5. Port with the most children embarked (1 point).

You must find, which port had the largest percentage of children (`Age<10`) embarked, i.e. number of children divided by total number of passengers embarked.

Input is indexed with `PassengerId` and is a concatenation of train and test sets. Output must be a single string with port letter.

In [101]:
def get_port(df):
    """Get port with the most children embarked."""
    data = df.copy()
    data['is_child'] = 0
    data.loc[data.Age < 10, 'is_child'] = 1
    data = data.groupby('Embarked').is_child.value_counts(normalize=True)
    return data.loc[data.index.get_level_values('is_child') == 1].nlargest(1).index[0][0]

In [102]:
PROBLEM_ID = 5

if TEST:
    total_grade += solutions.check(STUDENT, PROBLEM_ID, get_port)

In [103]:
port = get_port(data)
port

'S'

### 6. Passengers per ticket (2 points).

Calculate average and maximum number of passengers per ticket.

Input is indexed with `PassengerId` and is a concatenation of train and test sets. Output must be a tuple of two values.

In [116]:
def get_ticket_stats(df):
    """Calculate passenger per ticket statistics."""
    return tuple(df.groupby('Ticket')['Name'].count().aggregate(['mean','max']).values)

In [117]:
PROBLEM_ID = 6

if TEST:
    total_grade += solutions.check(STUDENT, PROBLEM_ID, get_ticket_stats)

In [118]:
stats = get_ticket_stats(data)
stats

(1.4090419806243273, 11.0)

### 7. Fare per passenger (3 points).

For each individual ticket, you must calculate fare per person for that ticket, and then calculate averages for each class. Note, that you will need to apply `groupby` and then you may consider using `.first()` of resulting `DataFrameGroupBy`.

Input is indexed with `PassengerId` and is a concatenation of train and test sets. Output must be `Series` with three elements, indexed by class.

In [121]:
data.loc[data.Pclass == 3].sort_values(by='Ticket').tail(20)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
383,0.0,3,"Tikkanen, Mr. Juho",male,32.00000,0,0,STON/O 2. 3101293,7.925,NaN,S
116,0.0,3,"Pekoniemi, Mr. Edvard",male,21.00000,0,0,STON/O 2. 3101294,7.925,NaN,S
910,NaN,3,"Ilmakangas, Miss. Ida Livija",female,27.00000,1,0,STON/O2. 3101270,7.925,NaN,S
730,0.0,3,"Ilmakangas, Miss. Pieta Sofia",female,25.00000,1,0,STON/O2. 3101271,7.925,NaN,S
404,0.0,3,"Hakkarainen, Mr. Pekka Pietari",male,28.00000,1,0,STON/O2. 3101279,15.850,NaN,S
143,1.0,3,"Hakkarainen, Mrs. Pekka Pietari (Elin Matilda ...",female,24.00000,1,0,STON/O2. 3101279,15.850,NaN,S
3,1.0,3,"Heikkinen, Miss. Laina",female,26.00000,0,0,STON/O2. 3101282,7.925,NaN,S
217,1.0,3,"Honkanen, Miss. Eliina",female,27.00000,0,0,STON/O2. 3101283,7.925,NaN,S
817,0.0,3,"Heininen, Miss. Wendla Maria",female,23.00000,0,0,STON/O2. 3101290,7.925,NaN,S
1022,NaN,3,"Spinner, Mr. Henry John",male,32.00000,0,0,STON/OQ. 369943,8.050,NaN,S
925,NaN,3,"Johnston, Mrs. Andrew G (Elizabeth Lily"" Watson)""",female,29.83238,1,2,W./C. 6607,23.450,NaN,S
889,0.0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.83238,1,2,W./C. 6607,23.450,NaN,S
784,0.0,3,"Johnston, Mr. Andrew G",male,29.83238,1,2,W./C. 6607,23.450,NaN,S
1136,NaN,3,"Johnston, Master. William Arthur Willie""""",male,29.83238,1,2,W./C. 6607,23.450,NaN,S
437,0.0,3,"Ford, Miss. Doolina Margaret ""Daisy""",female,21.00000,2,2,W./C. 6608,34.375,NaN,S
87,0.0,3,"Ford, Mr. William Neal",male,16.00000,1,3,W./C. 6608,34.375,NaN,S
1059,NaN,3,"Ford, Mr. Edward Watson",male,18.00000,2,2,W./C. 6608,34.375,NaN,S
737,0.0,3,"Ford, Mrs. Edward (Margaret Ann Watson)",female,48.00000,1,3,W./C. 6608,34.375,NaN,S
148,0.0,3,"Ford, Miss. Robina Maggie ""Ruby""",female,9.00000,2,2,W./C. 6608,34.375,NaN,S
236,0.0,3,"Harknett, Miss. Alice Phoebe",female,29.83238,0,0,W./C. 6609,7.550,NaN,S

In [0]:
def get_fare_per_pass(df):
    """Calculate fare per passenger for different classes."""
    pass

In [0]:
PROBLEM_ID = 7

if TEST:
    total_grade += solutions.check(STUDENT, PROBLEM_ID, get_fare_per_pass)

### 8. Fill missing age values (3 points).

In problem 3 you filled missing age values with average for all passengers. Now, you need to fill them according to class and sex. For example, for a female passenger from 2d class, missing age value must be filled with average age of females in 2d class.

In this problem, you may need joins and `.apply()`, although there are several ways to get the same result.

Input is indexed with `PassengerId` and is a concatenation of train and test sets. Output must be a **new** dataframe with the same structure as input, but without missing values in `Age` column.

In [166]:
def fix_age_groupped(df):
    """Fill missing age values."""
    data = df.copy()
    meanAge = data.groupby(['Pclass','Sex'])['Age'].mean()
    data = data.reset_index().set_index(['Pclass','Sex'])
    data['Age'] = data['Age'].fillna(meanAge)
    return data.reset_index().set_index('PassengerId')[df.columns]

In [167]:
PROBLEM_ID = 8

if TEST:
    total_grade += solutions.check(STUDENT, PROBLEM_ID, fix_age_groupped)

In [168]:
data = fix_age_groupped(df)
# data.loc[df.Age.isna()]
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### 9. Finding couples (3 points).

Based on the code from Lecture 5, build a dataframe of couples. Filter it by survival status: select those couples, in which only one of spouses survived or none of two. Built survival statistics by class, i.e. ratio of couples with partial survival divided by total number of couples in class.

Input is indexed with `PassengerId` and is a concatenation of train and test sets. Output must be `Series` with three elements indexed by values from `Pclass` column.

In [0]:
def find_couples(df):
    """Fill missing age values."""
    pass

In [0]:
PROBLEM_ID = 8

if TEST:
    total_grade += solutions.check(STUDENT, PROBLEM_ID, find_couples)